Repository: AdaCore/gnatstudio
Catalog: gvd/po/*.po
Languages: fr

source: 3D Look
fr: Apparence 3D

source: Abort
fr: Avorter

source: About...
fr: À propos...

source: About GVD...
fr: À propos de GVD...

source: Add
fr: Ajouter

source: Address
fr: Adresse

source: Advanced...
fr: Plus...

source: Advanced Breakpoint Settings
fr: Point d'arrêt. Paramètres avancés

source: Align On Grid
fr: Aligner sur la grille

source: All assertions
fr: Toutes les assertions

source: All exceptions
fr: Toutes les exceptions

source: and a description as complete as possible (including sources)
fr: et une description aussi complète que possible (avec les sources)

source: Arguments Selection
fr: Sélection des arguments

source: Asm and Source
fr: Asm et Source

source: Asm Code
fr: Code Assembleur

source: Assembly
fr: Assembleur

source: Attach To Process...
fr: S'attacher à un processus...

source: Auto-Align Displays on Nearest Grid Point
fr: Aligner automatiquement sur la grille

source: Automatic Display of Variables
fr: Affichage automatique des variables

source: Auto-Refreshed
fr: Réaffichage automatique

source: Big Item Height
fr: Hauteur des gros éléments

source: Break on exception:
fr: Stopper sur l'exception :

source: Break On Exceptions
fr: Stopper sur les exceptions

source: Break only when following condition is true:
fr: Stopper seulement lorsque la condition suivante est vérifiée :

source: Breakpoints
fr: Points d'arrêt

source: Break when the variable:
fr: Stopper lorsque la variable :

source: Bug detected in GVD
fr: Bug détecté dans GVD

source: built for
fr: construit pour

source: by Emmanuel Briot & Arnaud Charlet
fr: par Emmanuel Briot & Arnaud Charlet

source: Byte
fr: Octet

source: Call Stack
fr: Pile d'appel

source: Cancel
fr: Annuler

source: Cannot create config directory
fr: Impossible de créer le répertoire de configuration

source: Cannot find sessions directory
fr: Impossible de trouver le répertoire de sessions

source: Changed Data
fr: Donnée changée

source: Change Directory...
fr: Changer de répertoire...

source: Choice
fr: Choix

source: Clear Window
fr: Éffacer la fenêtre

source: Clickable Item
fr: Élément cliquable

source: Click in the 'Enb' column to change the status
fr: Cliquer sur la colonne 'Act' pour changer le statut

source: Click on the OK button to close this window.
fr: Cliquer sur le bouton OK pour fermer cette fenêtre.

source: Clone
fr: Cloner

source: Close
fr: Fermer

source: Color Highlighting
fr: Mise en couleur

source: Command
fr: Commande

source: Command History...
fr: Historique des commandes...

source: Command History
fr: Historique des commandes

source: Commands
fr: Commandes

source: Comments
fr: Commentaires

source: Continue
fr: Continuer

source: Continue program being debugged, after signal or breakpoint
fr: Continuer le programme en cours de déboggage, après un signal ou un point d'arrêt

source: Continue Until Line
fr: Continuer jusqu'à la ligne

source: Continue without Signal
fr: Continuer sans signal

source: Copy
fr: Copier

source: Could not find core file:
fr: Impossible de trouver le fichier core :

source: Could not find executable
fr: Impossible de trouver l'exécutable

source: Could not find file:
fr: Impossible de trouver le fichier :

source: Could not get the type of
fr: Impossible d'obtenir le type de

source: Could not get the value of
fr: Impossible d'obtenir la valeur de

source: Could not parse type or value for
fr: Impossible d'obtenir le type ou la valeur de

source: Could not spawn the remote process:
fr: Impossible de lancer le processus distant :

source: Created config directory
fr: Repertoire de configuration crée :

source: Current Line
fr: Ligne courante

source: Cut
fr: Couper

source: [--dargs [debugger options]] [--pargs [program options]]
fr: [--dargs [options du débogueur]] [--pargs [options du programme]]

source: [--dargs [debugger options]] [--pargs [program options]]
fr: [--dargs [options du débogueur]] [--pargs [options du programme]]

source: Data
fr: Donnée

source: Debugger
fr: Déboggueur

source: debugger:
fr: déboggueur :

source: --debugger DEBUG use DEBUG as the underlying debugger.
fr: --debugger DEBUG utilise DEBUG comme moteur de déboggueur.

source: Debugger Host
fr: Hôte pour le déboggueur

source: Debugger Name
fr: Nom du déboggueur

source: Decimal
fr: Décimal

source: Default Color
fr: Couleur par défaut

source: Define Command...
fr: Définir une commande...

source: delete
fr: supprimer

source: Delete Files Not Found
fr: Supprimer les fichiers non trouvés

source: Detach Process
fr: Détacher le processus

source: Detect Aliases
fr: Détecter les alias

source: Directory Selection
fr: Selection d'un répertoire

source: Detect Aliases (shared data structures)
fr: Détecter les alias (structures de données partagées)

source: disable
fr: désactiver

source: Disp
fr: Aff

source: Display
fr: Afficher

source: Display Any Expression...
fr: Afficher une expression...

source: Display Arguments
fr: Afficher les arguments

source: Display Explorer Tree
fr: Afficher l'explorateur

source: Display Expression...
fr: Afficher une expression...

source: Display Grid Points
fr: Afficher les points sur la grille

source: Display Line Numbers
fr: Afficher les numéros de ligne

source: Display Local Variables
fr: Afficher les variables locales

source: Display Registers
fr: Afficher les registres

source: Edit
fr: Édition

source: Edit Breakpoints...
fr: Éditer les point d'arrêts...

source: Edit Buttons...
fr: Éditer les boutons...

source: Edit Current Source...
fr: Éditer le source courant...

source: Edit Displays...
fr: Éditer les valeurs affichées...

source: --editor-window=xid Use xid as the editor X window.
fr: --editor-window=xid Utiliser xid comme fenêtre X d'éditeur.

source: Edit Sources
fr: Édition de fichiers

source: Enb
fr: Act

source: Enter an expression to display:
fr: Entrer une expression à afficher :

source: Enter commands to execute when program stops:
fr: Entrer les commandes à exécuter lorsque le programme s'arrêtera :

source: Enter the arguments to your application:
fr: Entrer les arguments pour l'application :

source: Enter the number of times to skip before stopping:
fr: Entrer le nombre de fois à ignorer avant de stopper :

source: Examine Memory...
fr: Examiner la mémoire...

source: Execute until selected stack frame returns
fr: Exécuter jusqu'à ce que l'appel séléctionné finisse

source: Exit
fr: Quitter

source: Exiting...
fr: Cliquer pour terminer...

source: Explorer
fr: Explorateur

source: Expression is a subprogram call
fr: L'expression est une commande du déboggueur

source: Expression Selection
fr: Sélection d'une expression

source: File:
fr: Fichier :

source: File
fr: Fichier

source: File Extensions
fr: Extensions de fichiers

source: File Location
fr: Situation d'un fichier

source: File Name Background
fr: Couleur de fond

source: : File not found
fr: : Fichier non trouvé

source: File not found:
fr: Fichier non trouvé :

source: File/Variable
fr: Fichier/Variable

source: Find
fr: Trouver

source: Finish
fr: Remonter

source: Font
fr: Fonte

source: Frame Number
fr: Numero de frame

source: Frozen
fr: Bloqué

source: GDB Settings...
fr: Configuration de GDB...

source: General
fr: Général

source: GVD Manual...
fr: Manuel de GVD...

source: gvd [options...] executable-file
fr: gvd [options...] fichier-exécutable

source: Halfword
fr: Demi-mot

source: Help
fr: Aide

source: Helpers
fr: Support externe

source: Hide all
fr: Cacher

source: Hide Big Items
fr: Cacher les gros éléments

source: Hide System Files
fr: Cacher les fichiers systèmes

source: --host HOST Run inferior debugger on HOST.
fr: --host HOST Exécuter le déboggueur sur HOST.

source: HTML Browser
fr: Navigateur HTML

source: Ignore
fr: Ignorer

source: in path.
fr: dans le chemin.

source: Interrupt
fr: Interrompre

source: Interrupt debugged program
fr: Interrompre le programme déboggué

source: Invalid command:
fr: Command invalide :

source: is
fr: est

source: Item Name
fr: Nom de l'élément

source: Item Type
fr: Nom du type

source: Item Value
fr: Valeur de l'élément

source: --jdb assume a java debugger.
fr: --jdb suppose un déboggueur java.

source: keep
fr: garder

source: Keywords
fr: Mots clefs

source: Kill
fr: Tuer

source: Language currently not supported by GVD:
fr: Langage non encore supporte par GVD :

source: Line:
fr: Ligne :

source: Line
fr: Ligne

source: list of files
fr: liste de fichiers

source: List Processes
fr: Lister les processus

source: Load List
fr: Charger la liste

source: Load program on machine TARG using protocol PRO.
fr: Charger program sur la machine TARG en utilisant le protocole PRO.

source: Location
fr: Endroit

source: --log-level [0-4] Set level of logging (Default is 3).
fr: --log-level [0-4] Selectionner le niveau de log (3 par defaut).

source: Memory
fr: Mémoire

source: Memory View
fr: Affichage de la mémoire

source: Modified
fr: Modifié

source: More Status Display...
fr: Autres affichages...

source: New Debugger...
fr: Nouveau déboggueur...

source: Next
fr: Suivant

source: Next Instruction
fr: Instruction suivante

source: No extension files
fr: Fichiers sans extension

source: (no file)
fr: (pas de fichier)

source: No file to edit
fr: Pas de fichier

source: Open Core Dump...
fr: Ouvrir fichier core...

source: Open Program...
fr: Ouvrir programme...

source: Open Program in a New Debugger
fr: Ouvrir programme dans un nouveau déboggueur

source: Open Recent
fr: Ouvrir fichiers récents

source: Open Session...
fr: Ouvrir session...

source: Open Session
fr: Ouvrir session

source: Open Source...
fr: Ouvrir fichier source...

source: Parameters
fr: Parametres

source: Paste
fr: Coller

source: Please report [see GVD Manual under Reporting Bugs]
fr: Veuillez reporter [voir manuel de GVD, section Reporting Bugs]

source: Preferences...
fr: Préférences...

source: Preferences
fr: Préférences

source: Print
fr: Afficher

source: Process Selection
fr: Sélectionner un processus

source: Program
fr: Programme

source: Program Counter
fr: Compteur de programme

source: Program File
fr: Fichier du programme

source: Program Host
fr: Hôte pour le programme

source: Protocol
fr: Protocole

source: read
fr: lue

source: read or written
fr: lue ou écrite

source: Recent messages (most recent first):
fr: Messages récents (le plus récent d'abord):

source: Record
fr: Enregistrer

source: Redo
fr: Refaire

source: Refresh
fr: Raffraichir

source: Regular expression
fr: Expression régulière

source: Reload Files
fr: Recalculer la liste de fichiers

source: Reload Sources
fr: Recharger les sources

source: remote
fr: distant

source: Remote Copy
fr: Copie à distance

source: Remote Shell
fr: Shell distant

source: Remove
fr: Supprimer

source: Replace Current Debugger
fr: Remplacer le débogueur courant

source: Replay selection
fr: Rejouer la sélection

source: Run/Start...
fr: Exécuter...

source: Save Session As...
fr: Sauver session comme...

source: Search...
fr: Chercher...

source: Search
fr: Chercher

source: Select All
fr: Tout sélectionner

source: Select and print stack frame called by this one
fr: Sélectionner la procédure appelée

source: Select and print stack frame that called this one
fr: Sélectionner la procédure appelante

source: Select Core File
fr: Sélectionner un fichier core

source: Selection
fr: Sélection

source: Separate Window
fr: Fenêtre séparée

source: Session List
fr: Liste des sessions

source: Set Breakpoint on
fr: Mettre un point d'arrêt sur

source: Set Breakpoint on Line
fr: Mettre un point d'arrêt sur la ligne

source: Setting value of
fr: Changer la valeur de

source: Set Value
fr: Affecter

source: Set Value of
fr: Affecter

source: Show...
fr: Afficher...

source: Show
fr: Montrer

source: Show all
fr: Montrer

source: Show ASCII
fr: Afficher en ASCII

source: Show Call Stack
fr: Afficher la pile d'appel

source: Show Current File
fr: Afficher le fichier courant

source: Show Current Location
fr: Afficher l'endroit courant

source: Show Line Numbers
fr: Afficher les numéros de lignes

source: Show Lines with Code
fr: Afficher les lignes avec code

source: Show Next Page
fr: Afficher la page suivante

source: Show Previous Page
fr: Afficher la page precdente

source: Show Type
fr: Afficher le typage

source: Show Value
fr: Afficher la valeur

source: Show Value + Type
fr: Afficher valeur + typage

source: Signals...
fr: Signaux...

source: Source Code
fr: Code Source

source: Source location
fr: Endroit du source

source: Source name
fr: Nom du fichier

source: Start the debugged program
fr: Démarrer le programme à débogguer

source: Start the debugged program, stopping at the beginning of the main procedure
fr: Démarrer le programme à débogguer en s'arrêtant au début de la procédure principale

source: Status Bar Time Out
fr: Temps d'expiration de la barre de statut

source: Step
fr: Avancer

source: Step Instruction
fr: Avancer d'une instruction

source: Step one instruction, but proceed through subroutine calls
fr: Avancer d'une instruction en ignorant les appels de procédures

source: Step one instruction exactly
fr: Avancer d'une instruction

source: Step program, proceeding through subroutine calls
fr: Avancer d'une ligne en ignorant les appels de procédures

source: Step program until it reaches a different source line
fr: Avancer jusqu'à ce que le programme atteigne une ligne différente

source: Stop always
fr: Toujours arrêter

source: Stop at beginning of main subprogram
fr: Arrêter au début de la procédure principale

source: Stop if not handled
fr: Arrêter si non gérée

source: Stop recording
fr: Arrêt de l'enregistrement

source: Strings
fr: Chaines

source: Strip Carriage Return
fr: Supprimer les caractères de retour chariot

source: Submit changes
fr: Confirmer

source: Subprogram
fr: Routine

source: Subprogram Name
fr: Nom de la routine

source: Syntax Highlighting
fr: Mise en évidence de la syntaxe

source: Tasks...
fr: Tâches...

source: Task Status
fr: État des tâches

source: Temporary breakpoint
fr: Point d'arrêt temporaire

source: Test
fr: Tester

source: The underlying debugger died unexpectedly. Closing it
fr: Le déboggueur sous-jacent a terminé de manière impromptue. Fermeture de ce déboggueur

source: This is the About information box.
fr: Ceci est la boite d'information à propos.

source: Thread Status
fr: État des threads

source: Title Background
fr: Titre

source: to reproduce the bug
fr: pour reproduire le problème

source: --tty Use controlling tty as additional
fr: --tty Utilise le terminal comme additionel

source: Undo
fr: Défaire

source: Undo changes
fr: Défaire

source: Unit size:
fr: Taille unitaire :

source: Unknown Language
fr: Langage inconnu

source: Unselect All
fr: Tout désélectionner

source: Update
fr: Mettre à jour

source: Update Value
fr: Mettre à jour la valeur

source: Usage:
fr: Utilisation :

source: using protocol:
fr: en utilisant le protocole :

source: --version Show the GVD version and exit.
fr: --version Afficher la version de GVD et quitter.

source: View
fr: Voir

source: View memory at &
fr: Afficher la mémoire à &

source: with the contents of the file
fr: avec le contenu du fichier

source: Word
fr: Mot

source: written
fr: Écrite

source: You must select at least one of the choices
fr: Vous devez sélectionner au moins un des choix

source: Zoom in
fr: Zoom avant

source: Zoom out
fr: Zoom arrière
